[
{"asin": "B07Z8P11Y5", "text": "While I am pleased with this product's ability overall, I did have one problem.  When I accidently dropped the shaver, one of the three heads became partially dislodged.  I was able to get it back in with a few tools, however, and accept the blame for dropping it.", "title": "Does a good job without the cutting and mess of a razor blade.", "location_and_date": "Reviewed in the United States 🇺🇸 on June 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Works well although I have to work a little more with this razor to get the same shave as my old one (a triple head). This is well made and holds a charge for a long time. There is a power level window Wichita nice. Happy with it.", "title": "Nice quality", "location_and_date": "Reviewed in the United States 🇺🇸 on June 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "After i use this razor, I look awesome!", "title": "nice razor", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Great tool. I have used several lower priced shavers in the past and I can see why this sets itself apart. For daily use, it gets very nearly as close a shave as using a razor (I use Gilette Mach 5). Very smooth and reliable. I haven't even noticed the battery display change yet with daily use. I should have bought one sooner.", "title": "Worth the money", "location_and_date": "Reviewed in the United States 🇺🇸 on June 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Sometimes misses a few whiskers.", "title": "Sometimes misses a few whiskers", "location_and_date": "Reviewed in the United States 🇺🇸 on June 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Es de buena calidad", "title": "Afeitadora", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Great razor, close shave. Only complaint is I wish the trimmer popped up instead of having to attach. Not that big of a deal though I don’t use it much.", "title": "Great razor", "location_and_date": "Reviewed in the United States 🇺🇸 on May 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Probably the best thing I’ve ever bought him. Buy this.", "title": "My husband is obsessed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I purchased a Braun Series 8 a few years ago.It worked fine for about one year then it stopped working.I reverted to my Braun Series 3 3040 which I got over 7 years ago the Series 3 served me faithfully until the battery failed a few weeks ago.After doing some research I decided to go for the Braun Series 7 this time.I like the following features its equipped with:• AutoSense Technology – This enables the shaver to sense beard density and adjust the motor to the power that is required.• Cutting Actions – The 7 Series offers 24’000 cutting actions per minute.• 360° Flex Head has the ability to adapt and move with the various contours of the face and aims to make shaving tricky areas much easier.• This provides 50 minutes of continuous cordless shaving power. A charge lasts 2 to3 weeks.• It has 3 flexible shaving elements/blades. Two of these are foils, and in the centre, there is a cutter that aims to cut hair that grows in various directions and lift up other hairs to be cut.• Wet & Dry– The Flex Head series is fully waterproof and can be used to shave either wet or dry. You can shave with shaving, cream, soap or foam. (I believe that my series 8 stopped working because I accidentally submerged it in water) this Series 7 claims to be 100% waterproof• Light Indicators – A cleaning light will indicate after using the shaver. A red cord indicator comes on when a user tries to use the shaver when it is plugged in and another red padlock indicator comes on after holding the button (also bleeps) for a few seconds to activate the travel safety switch. There is also battery life and foil cassette indicator (which lets a user know when to replace – every 18 months).• This series 7 has an extra button underneath the power on/off button. When pressed it indicates the battery charge and if the foil cassette needs replacing without switching the shaver on.I am very impressed with this shaver. I shave every day seven (7) days a week and so farit has provided a very clean smooth fast and comfortable shave.However, time will tell about its durability", "title": "Impressive", "location_and_date": "Reviewed in the United States 🇺🇸 on October 2, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "la caja de empaque tiene apariencia de usada, para ser un producto Aleman, les falta calidad en el empaque, la maquina funciona muy bien, rasurado a ras, tal como lo esperaba, en la reseña dice que tiene un sensor en la cuchilla, pero al recibir no se evidencia que lo tenga.", "title": "Calidad", "location_and_date": "Reviewed in the United States 🇺🇸 on March 30, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "I’ve literally never written a review for anything before but this has been so good I feel compelled to write one. I’ve tried everything for years to not have razor bumps EVERYTHING from straight razors to the 7 razor Gillette things and only shaving once every couple days still horrible razor bumps…. This gave me just as smooth as a shave with a razor but no bumps and I’ve shaved every day honestly would pay double for this it works and if your thinking about getting it but it’s pricey it is BUT DO IT I’ll never have anything else", "title": "Best Money I’ve Ever Spent!!!!", "location_and_date": "Reviewed in the United States on April 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "This was my first shaver over $25, and it has disappointed for 10 months now. It gets closer to the skin more easily than the cheaper shavers, but misses hairs all over the place even after several passes, even after trimming down hairs with a separate trimmer.", "title": "Misses Hairs", "location_and_date": "Reviewed in the United States on July 6, 2023", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "Thank Goodness we found this razor for my husband.  I trim is eyebrows, beard and mustache.  GREAT razor for his face, neck etc..  Works Very WELL.  PBJ", "title": "Durable", "location_and_date": "Reviewed in the United States on April 4, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Para el afeitado,es útil,hay que insistir en repasar varias veces para lograr el afeitado", "title": "Buena duración de la carga", "location_and_date": "Reviewed in the United States on April 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "This razor is wonderful, very glad I bought it. Shaves as close as a Gillette or a Harry’s, really.", "title": "Great razor", "location_and_date": "Reviewed in the United States on June 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I've been using cheap-ish Philips Norelco for 5 years, purchased at Target for like $30, and it was okay-ish. Not perfect, but fast and reliably average.Read a lot of reviews, all praising Braun Series 7 as one of the best electric shavers there is. Bought this one, and frankly, I'm disappointed.Comparing to my old shaver, this one is much slower. The old one didn't care if it's 3-4 days-long brush of new growth, or 1 day - it would shave it off at the same speed, which is essential: my time if valuable in the morning!This one takes significantly longer to get to acceptably clean shave, seems to be cutting hair 0.05mm at a time, thus requiring multiple passes in the same area, which is irritating and takes forever.Tell me, am I using it wrong?Other than that, packaging is good, build quality is good, I like the travel case. It's a shame the trimmer attachment is not built-in and you have to actually switch it. And of course, the cleaning part - I just don't get it. These small particles of shaven hair are everywhere inside. I shake them off, but they cling to the inside surfaces. I hope it's not a big deal, but the cleaning part frustrates me.", "title": "I was expecting more", "location_and_date": "Reviewed in the United States on December 10, 2022", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "I'm retired so it's perfect for me. I like to shave every morning. It's not as close as a blade but does a decent job. Especially if you just have to go out for a few hours.", "title": "Happy with my purchase.", "location_and_date": "Reviewed in the United States on May 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I've only had this for a month, and it gives me a close easy shave.The battery seems to last long.The attachments are a plus.", "title": "Close Shave", "location_and_date": "Reviewed in the United States on May 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have been using rotary razors for the past few years and have never been satisfied with the results. I am 83 years old and have to take blood thinners. Shaving with a blade is no longer practical. I have bought 3 rotarys based on reviews but none of them gave me a close shave. I received my Braun 7 yesterday and can't believe what a great job it does! It gave me the closest shave I've had in years,  and I didn't have to go over the same areas several times trying to get a close shave. I've only had my Braun for one day but I am delighted with it!!!", "title": "Amazing razor!", "location_and_date": "Reviewed in the United States on March 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Nice project", "title": "Electric shaver", "location_and_date": "Reviewed in the United States on June 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Context: I have sparse hair with sensitive skin (asian)This shaver will not remove everything, but it will remove a bulk of it. If you've havent shaved a lot, use this first and then your favorite double edge razor.It also came with a body trimming kit, so that's definitely another plus. It's easy to clean and battery life lasts forever.", "title": "It will not remove all your hair -- but it will remove most of it", "location_and_date": "Reviewed in the United States on January 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "It does shave closer than elec razor before.", "title": "Got what I paid for.", "location_and_date": "Reviewed in the United States on May 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I got this for my 18 yo son for Christmas.  He loves it and makes shaving less of a hassle.  No problems with in grown hairs or razor burn.", "title": "Great gift", "location_and_date": "Reviewed in the United States on January 31, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "I really like the shaver, it does a great job at carving through a week long proto-beard.  The battery life is really decent i change once every 2-3 weeks if i shave every other day.  Not as brutal on my face as my old rotary shaver.There is one annoying habit of this razor.  The way the head tilts back and forward to follow contours of your face there is a space, while shaving the vibrations of the razor cause the shaver to leak from the hinge area and causes the shaver to dust your clothes with whisker bits.  Yeah, they brush off but its annoying.", "title": "Great shave, annoying habit", "location_and_date": "Reviewed in the United States on August 25, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "I ordered this razor on Sunday and received it Friday. I immediately read all instructions and charged it for just under an hour. I'm not sure how many shaves I'll get before the next charge. This thing shaves almost as close as a straight razor. For the past 53 years I've been using a triple rotary razor. The foil head sure puts that to shame for speed and closeness. Now only time will tell how long it last.", "title": "Shaving capability", "location_and_date": "Reviewed in the United States on March 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Ok worse part of this shaver, THE INSTRUCTIONS MANUEL.. O MY, ITS A PICTURE BOOK.. AN I CANT MAKE HEADS OR TAILS OUT OF IT.. HOW STUPID.. NO WORDS TO INSTRUCT.. JUST PICTURES THAT SEEM TO CONTRICTDICT EACH OTHER.. SORRY IM A POOR PICTURE READER.. BUT OTHER THAN THAT...Just got.  Charged fully an me, a woman bought for me to shave my legs.. yippee,  easy an happy..May get one for my hubby,  if he uses mine to much", "title": "Love so far ..but...", "location_and_date": "Reviewed in the United States on March 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Not the best shaver I’ve ever owned. Struggles if you have more than two days of facial growth.", "title": "Mixed results.", "location_and_date": "Reviewed in the United States on May 20, 2023", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "Sharp blades,  cuts well, easy to use would buy again. hope never to have too", "title": "Love it.", "location_and_date": "Reviewed in the United States on January 23, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Best shave I've ever gotten from an electric razor.", "title": "Great shave", "location_and_date": "Reviewed in the United States on May 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "This is the best razor I have ever used in the past 42 years. It shaves as close as a blade without the risk of cutting yourself. Also use it to shave my head.", "title": "Best razor I have ever used!", "location_and_date": "Reviewed in the United States on April 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I bought this Braun as a Christmas present for my husband. It was the perfect gift, and he loves it.", "title": "Good present", "location_and_date": "Reviewed in the United States on January 3, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "I got 2 weeks straight out of one charge, did a good job of not irritating my skin", "title": "Nice shaver", "location_and_date": "Reviewed in the United States on April 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "LOVE the Braun  7 for closenessbattery does not last very long", "title": "LOVE the Braun  7", "location_and_date": "Reviewed in the United States on December 2, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "My first electric shaver, so maybe I expected to much. For a quick shave to get you going it works okay. I havr to go back to the razor if I want a close, smooth shave.", "title": "Not going to shave as close as a razor", "location_and_date": "Reviewed in the United States on February 6, 2023", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "It gets the job done.It doesn't have all the expensive extras. Just what I was looking for.I received one as a gift, and then  bought the same for Dad to replace his manual razor routine", "title": "Nice Razor", "location_and_date": "Reviewed in the United States on September 9, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Good razor. Seems like a dry shave is closer. Dropped it while in the shower, but it didn’t break and still works. Have to be careful when shaving my neck, cut it a couple of times.A full charge lasts over a month even if used daily for a couple of minutes.", "title": "Good razor for dry or wet shave", "location_and_date": "Reviewed in the United States on July 29, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Can't go wrong with a Braun.  Been a customer for many years.  Never been disappointed.", "title": "It's a Braun.", "location_and_date": "Reviewed in the United States on March 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I'm an old guy who had shaved a long time. I went to blades years ago because of the closer shave. This Braun actually shaves closer than a blade, I was quite surprised. I've used Norelco off and on for years and it never shaved this well.", "title": "Better than a Blade", "location_and_date": "Reviewed in the United States on January 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Never use an electric shaver before and was very skeptical on how it would actually “shave” my special face.Now, After using it for months now I can’t believe I used to shave with a razor.Great product for those with sensitive skin", "title": "Cleaning station not necessary", "location_and_date": "Reviewed in the United States on December 23, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Totally disappointed, after reading the advertising, face still with beard, not a clean face,like the regular shaving blade", "title": "Not a cleaning face,beard still on", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "Really a difficult review.  The shaver works well.  My beard is tough.  Doesn't get as close as a blade, but close enough for me.  Good for every-other-day approach.  And really nice for touch ups if necessary.  Works well with dry or wet beard.  Doesn't pull hairs or aggravate my skin.  Seems to rinse clean easily.  Comfy to hold.So all that is good...BUT.  As others have mentioned, the documentation for this thing is really beyond terrible.  This is a fairly expensive shaver.  I'd like know that I am using it correctly for best results, and that I'm taking care of it properly to maintain those results and not impact the lifespan of the device.  All you get are goofy little graphics.  Use your words Braun.  It's not that difficult.  Yes, you will need some translations.  Deal with it.A good example of how lacking the documentation is: One picture shows a drop from a small bottle being applied to fingertip then to shaving head.  There is no such small bottle in the box, nor any explanation of what it might be.  So I have to email Braun, find out that this is \"light machine oil\", then go and buy some of that, as doing this maintenance step weekly is apparently important.  I guess if the bottle of oil was included I could've figured things out, but lacking that and any kind of explanation led me to do way too much work to properly understand what was required for my shaver.So a 4/5 for the shaving experience, but a 0 for the customer experience.", "title": "Horrible documentation", "location_and_date": "Reviewed in the United States 🇺🇸 on October 4, 2020", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "This was a surprisingly huge improvement in comfort and errant whisker catching over the series 3, which I returned. Well worth the extra cost. I got it without the cleaning attachment--I clean and lube manually with a drop of appliance oil as noted in the supplied instructions. I never thought I'd say this, but I actually enjoy shaving with this thing!", "title": "LIke buttah!", "location_and_date": "Reviewed in the United States 🇺🇸 on October 11, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My first Braun! I used a panasonic arc 4 before, it was okay. Gives me bumps, not so close shave, and a bit difficult to clean. I went back to manual shaving. This is the best way for me but the process is long and I get pretty lazy sometimes. The series 7 was on sale for prime day so I decided to give it a try. I ran it across my face yesterday and it feels decent. Good close enough shave, and it was easy to clean. My face didn't get bumps or burns! I do wish I spend the extra money for the series 7with the smart care center though. That's my only regret. Yo Braun, you need to sell the smart care center separately in the US so I can get one. Why only UK gets that?", "title": "Nice shave", "location_and_date": "Reviewed in the United States 🇺🇸 on June 29, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have a Braun Series 3 with cleaning system. It's getting older that's why I wanted to replace it.Since I have a thin face it's sometimes difficult to get every hair straight away. Therefore I thought that Series 7 with flex shaver head would be a good option.When I started the shaver it was really loud, much louder than my old Series 3 shaver. I was really astonished. I was kind of reluctant to use it to shave my face. Then, I used the palm of my hand to explore the flexible the shaver head. It actually has a flexible suspension but comparing it with my Series 3 there hardly was a difference.With that said, I decided to return the shaver. Doesn't make sense to me!", "title": "Way too loud", "location_and_date": "Reviewed in the United States 🇺🇸 on January 2, 2023", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "Feels solid and well made. Shaves very close without irritation. Handles a three day beard without a fuss. I like the shaver a lot.But the manual. Oh dear. It's awful. It really is. All pictograms. Peculiar and  cryptic pictograms, including one that looks to be illustrating the classic Samberg/Timberlake work about junk in a box.Braun, please. Spend some money on a manual with words. Putting it on line would be fine. You put all the legal gibberish in words; put the actual operation manual in words.", "title": "Excellent shave. But the manual...oh my.", "location_and_date": "Reviewed in the United States 🇺🇸 on June 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "The razor works very well but I still haven't fully understood it, I read the reviews about bad instructions but thought ' hey, I'm a real time systems designer....I can figure anything out, anything 'Not so. The pictograms are frustrating to the point of insanity and I believe several try to illustrate bits I don't even get in this package.I know how it works, The writer by now is so familiar ,he can't put himself in the place of a first time reader,Vorsprung Durch Technic. Shhhh!  Classified.", "title": "Great razor. Disastrous instructions", "location_and_date": "Reviewed in the United States 🇺🇸 on October 17, 2021", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Gives a close shave and the battery life is quite good.  Only small issue is that I use both the close shaving head and the trimmer head each day and it’s not that easy to change the heads.  Overall I’m happy with the product though.", "title": "Good product—somewhat hard to change shaving heads", "location_and_date": "Reviewed in the United States 🇺🇸 on April 23, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "This has made shaving easier than ever. I would always get cut from razors on my neck area and this has completely eliminated that for me. Amazing for sensitive skin and/or thick hairs like mine.", "title": "Great for sensitive skin", "location_and_date": "Reviewed in the United States 🇺🇸 on December 19, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I lovvvvve thus razor.  Very well built. Charges quickly and holds charge.  Also comes with a charging station", "title": "Well built", "location_and_date": "Reviewed in the United States 🇺🇸 on February 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My husband have trouble with holding things steady.", "title": "The razor was dull.", "location_and_date": "Reviewed in the United States 🇺🇸 on June 22, 2023", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "Great shaver. Very close shave. Easy to clean. Fair price", "title": "Electric shaver", "location_and_date": "Reviewed in the United States 🇺🇸 on February 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "No sideburn trimmer", "title": "Close shave", "location_and_date": "Reviewed in the United States 🇺🇸 on January 13, 2023", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "I am amazed at how much electric shavers have improved since I last used one many years ago.  This unit gives me a closer shave that a razor... it's really amazing.  It's also quicker than using a razor, and obviously much less messy.  The attachments are also very good.  I have quite short hair, and I can actually use this unit for trimming my hair when I am traveling, so I don't have to also carry my hair clippers.  I'm giving it 5 stars because it works so well.  I concur with other reviewers, however, that the manual is complete garbage.  The cryptic little pictures are practically useless.", "title": "great shaver, poor manual", "location_and_date": "Reviewed in the United States 🇺🇸 on August 9, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Works great.  Glad no more cuts or tosing blades every two shaves. Glad I switched. Users TIPS: A light touch is absolutely best.  Also, shave either every morning or every other day.", "title": "Usually I don't p enjoy Electric shavers....", "location_and_date": "Reviewed in the United States 🇺🇸 on April 9, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Very pleased with how this razor works and it gets the job done Lickety Splite!", "title": "Good shave", "location_and_date": "Reviewed in the United States 🇺🇸 on January 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Everything is good", "title": "Works p", "location_and_date": "Reviewed in the United States 🇺🇸 on February 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Seriously… it’s a religious experience. I f-ing love this electric razor. I should have bought one decades ago. Do not hesitate… battery life is other worldly, closest shave I’ve ever had, sleek as a Greek god. DO NOT HESITATE!", "title": "Best thing that has ever happened to me", "location_and_date": "Reviewed in the United States 🇺🇸 on October 2, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Provides a clean shave in a relatively short time.", "title": "A clean shave", "location_and_date": "Reviewed in the United States 🇺🇸 on January 26, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "He is very happy with his gift!", "title": "My husband could not be happier!", "location_and_date": "Reviewed in the United States 🇺🇸 on January 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Complete rubbish.  Braun used to make good shavers, this is utter trash!  You have to remove the shaver head to attach the trimmer; that means everyday you have to do this; so the latching mechanism wont last long; and after only 2 months the shaver head falls off when shaving which is VERY ANNOYING!", "title": "Utterly useless low quality trash!  Head falls off all the time when shaving", "location_and_date": "Reviewed in the United States 🇺🇸 on July 11, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Not now. Just started using this.", "title": "On first use it seems fine. Too early to opine on these questions.", "location_and_date": "Reviewed in the United States 🇺🇸 on January 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Works well, battery stays charged and is easy to clean.", "title": "High Quality Shaver", "location_and_date": "Reviewed in the United States 🇺🇸 on January 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "At 1st, I was reluctant to spend 150.00 or more for a shaver, but after giving it a few weeks, I am glad I did. Battery is excellent, recently, I went on a trip, did not take charger, lasted over 2 weeks easy. Cleaning is different by removing the head, but it's easy. I recommend this product.", "title": "Smooth shave in short time", "location_and_date": "Reviewed in the United States 🇺🇸 on June 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "This shaver is a disappointment. It does an okay job of removing hair, but the major problem is the mess it creates. Cut hair ends up all over my shirt, needing to clean up after every shave. If you value a tidy shaving experience, I recommend looking elsewhere.", "title": "Messy Shaver Review: Cut Hair Everywhere!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Easy to use without all the unnecessary gadgets", "title": "Simply perfect", "location_and_date": "Reviewed in the United States 🇺🇸 on December 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I really have to tell anybody out there who is on the fence about getting this. Do it!!  I have bought all the rest but now I have the best. As close to a blade shave as u can get. Not kidding .  Battery lasts a loooong time . Hands down the best!!. My wife uses for her legs!! Hahaha!! Easy to clean also.", "title": "Great!!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 7, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Multiple passes to get a clean shave. Have to take the head off to rinse it out and brush the base clean.", "title": "takes a long time to have a smmoth face", "location_and_date": "Reviewed in the United States 🇺🇸 on August 29, 2022", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "Seriously, this is a life changing purchase, i regret not buying the one that came with the cleaning center, this is worth every penny.My experience so far has been flawless, every time i use it i learn something new, and the most amazing thing about this razor is that you actually fell like is giving you a massage while leaves you skin smooth and well shaved.Don't make the same mistake i did and get it with the cleaning center.", "title": "Look no Further!, Buy It!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Swivel doesn't help shaving. Makes the the head loose contact with skin.", "title": "Swivel doesn't help shaving.", "location_and_date": "Reviewed in the United States 🇺🇸 on October 1, 2022", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "I got this razor for my boyfriend and he really loves it. The only issue that he has with it is that it doesn't give a very smooth shave.", "title": "Great Razor", "location_and_date": "Reviewed in the United States 🇺🇸 on July 15, 2022", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "I’ve had a series 3 Braun for literally 10+ yrs. Loved it! I thought going with a newer series 7 would mean better… it’s not! This is a terrible electric razor. It doesn’t give a close shave, the head is so dang bulky you cannot be precise with it, forget trying to have a beard and use this to clean around the edges because it grabs and pulls your beard! This thing should only cost $30 for the quality. It’s also inconvenient to have to take the shaving head off and to switch to the trimmer. The older models included the trimmer built in. The good news is that you will rarely have to clean it, because it throws the clippings and dust everywhere! I’m shocked it is so terrible. Find another brand I guess.", "title": "Just cheaper quality and worse shave", "location_and_date": "Reviewed in the United States 🇺🇸 on May 19, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I've only used the shaver attachment so far. The battery life and power is the main reason i was forced to get this. You've probably been let down by mid-priced shavers like I have and thought that you have to break into 3 figure shaver territory to get a decent shave. Unfortunately you are correct sir. Just grab this one and be done farting around with the lower priced shavers.", "title": "Just gotta spend the money these days", "location_and_date": "Reviewed in the United States 🇺🇸 on September 4, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Stll difficult cutting neck hair. Wish it had flipp up sideburn trimmer", "title": "Overall best razor for cutting hair", "location_and_date": "Reviewed in the United States 🇺🇸 on March 14, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "If the product was much cheaper I'd be more generous with my rating but given the price I had high expectations. My Norelco razor was better at giving a clean shave which was a quarter of the price.. That being said it was great at clearing my beard off I had a 3in beard growing and it took maybe 2 min to get rid of it all, I was very impressed with that. The problems arose when I tried to get rid of the remaining stubble and random hairs here and there that is what really took my experience down. I had to press so hard for it to pick up on anything which was okay I guess for my face but my neck looked like I got attacked by a wild animal afterwards and it still didn't get everything..", "title": "Not great for a clean shave which is why I purchased it.", "location_and_date": "Reviewed in the United States 🇺🇸 on March 1, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "Easy to handle and doesn’t pull hair when using", "title": "Easy to handle and doesn’t pull hair when using", "location_and_date": "Reviewed in the United States 🇺🇸 on March 19, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Very disappointed for the price.  The head pivots very comfortably, but the comfort is pointless when it refuses to cut very well.  I kept going over multiple areas and it just would not get real smooth and kept leaving random spots that it just would not cut for some reason.  I do not let my length get more than a quarter inch long which it should handle without issue.  Especially since my hair is neither thick nor coarse.  I shall have to return to my old Panasonic.", "title": "does not shave very well", "location_and_date": "Reviewed in the United States 🇺🇸 on June 28, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "You get a close shave with this razor.", "title": "It is a great razor!", "location_and_date": "Reviewed in the United States 🇺🇸 on November 17, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "This is an edit to a previous review. My first unit started ripping the hairs out of my face, so I was pretty harsh in my original review. I wasn’t very hopeful they’d make it right, but Braun took care of it surprisingly efficiently. Their warranty process was completely online, they paid for shipping, and I was back in business very quickly.", "title": "Warranty work went well", "location_and_date": "Reviewed in the United States 🇺🇸 on August 19, 2020", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "As this was the first time, at age 78 to purchase and use an electric razor, I am especially pleased on how easy and comfortable it use has become.  I still you a blade for daily usual use, but when in a a hurry or for a quick clean up, I find this of great value.", "title": "Very easy and effective", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Very nice produce. German made.", "title": "great product.", "location_and_date": "Reviewed in the United States 🇺🇸 on November 30, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have always held Braun products in high esteem given their German quality. I had an older Series 7, and was in the market for a new one. I saw the positive reviews on this one and decided to give it a try. I am lucky I did as it is fantastic! The new head (they say it has something called 360 Flex technology) makes it feel as if it has a suspension system, allowing the razor to glide over my face. It cuts very well and the battery life is superb. It's also easy to clean making it great for travel. The razor also just looks very cool in the charging stand in my bathroom. Highly recommend it!", "title": "What a shaver...flex head is a game changer!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 25, 2020", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I’m happy with how it shaves and has shaved for the last few months except for one thing. My beard typically requires electric razors to be pressed fairly firmly on and doing so with this one the head keeps popping off the razor and then you end up with a mess all over you and the sink.  Disappointed for the cost this happens.", "title": "One bad flaw for tough beard…", "location_and_date": "Reviewed in the United States 🇺🇸 on October 17, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "Doesn't shave as close as I expected wet or dry.", "title": "Not impressed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 28, 2022", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "This razer is nice enough.  No thrills... just fine.  The directions are not great on cleaning and use with water", "title": "Nice enough", "location_and_date": "Reviewed in the United States 🇺🇸 on September 6, 2021", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "Really works well and is s good value.  Love this brand.", "title": "It works", "location_and_date": "Reviewed in the United States 🇺🇸 on December 26, 2021", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "I have been using electric razors since 1976 and the only other one that came close was a Norelco Triple Header I bought in the Navy over 40 years ago and this thing is better than that by 5 miles !!!", "title": "BEST ELECTRIC RAZOR I HAVE EVER FOUND !!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 14, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I had a Series 5 from about 10 years ago, but it was difficult to do my neck (used to have to us a blade razor to finish my neck and some other places, but this does a much nicer job.", "title": "Does my neck pretty well.", "location_and_date": "Reviewed in the United States 🇺🇸 on December 16, 2020", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "The beard trimmer is great. The body trimmer or whatever you want to call it literally doesn't work. I had to go over a single hair 26 times before it cut.", "title": "Only half works", "location_and_date": "Reviewed in the United States 🇺🇸 on January 7, 2023", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "Works well. Takes multiple passes to get a close shave. I can recommend it for those with light beard, its only test.", "title": "Good buy.", "location_and_date": "Reviewed in the United States 🇺🇸 on August 3, 2021", "verified": true, "rating": "4.0"},
{"asin": "B07Z8P11Y5", "text": "the jury is still up on this one.  I have noticed that when you are outside, and it is hot day, then you come in to clean up and your skin is slightly damp it will cause the head to catch and dislodge and I have even had the three head members dislodge and they can be hell getting them back into the proper location. This was a more expensive shaver and i felt it would be top quality but I am fast losing trust in it. It is a shame as it is a smooth operation and provides a close shave.", "title": "Braun is a name i have come to trust for quality, but", "location_and_date": "Reviewed in the United States 🇺🇸 on June 28, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I have used Braun shavers for more than 30 years and have always been very satisfied. When came time to update my older series 7 I saw this version on Amazon... Also a series 7 I figured that it would cut just as well... I ordered this one to spice things up as the head pivoted in every direction - I figured it would give a closer shave... WRONG... This is the worst shaver ever... If I shave every day, then maybe it would be OK, but if I skip a few days (say the weekend), shaving on the Monday morning is absolutely BRUTAL!!! It's like if the shaver was pulling every single hair out of my face instead of cutting them!!! I would return it in a nano second but I am out of the US now and can't send it back to Amazon... So, to me, this shaver is garbage... But to those who would say that I am a Braun basher, I have ordered a new shaver to replace this one, also a Braun, but the series 9... I most certainly hope that I will have more luck with that one... Anyway, this model was the BIGGEST letdown ever :(", "title": "Worst shaver ever!", "location_and_date": "Reviewed in the United States 🇺🇸 on September 13, 2021", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "First time i used it, I was pretty dissapointed but the second time I knew what I was doing and it was a breeze! No annoying cuts or feeling like you've just peeled your face. Highly recommend!", "title": "Throw that razor away!!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 25, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Unstable recharging base, no cover to protect shaving screens, and worst of all unusable user instructions. They are black and white illustrations, tightly packed so as to be indecipherable. Should I use a skin prep or shaving creme? Are there particular stokes to use? Helpful hints for a better shave? How to clean after a shave? They provide a brush, but I have no idea where the hair went. The head is clean. Why not provide a link to access a usable owner's manual! Shaves great, but should have sent it back.", "title": "Sad recharging base", "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I've had Braun shavers for 20+ years. When the previous one died (after about 8 years) I decided to \"upgrade\". This was a great choice as it functions much better than my previous Braun Series 5.", "title": "Great shaver.", "location_and_date": "Reviewed in the United States 🇺🇸 on February 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Not what I expected for a regularly priced razor at $150, I got it for $99 on Prime Day. So disappointed that it leaves whiskers behind. Very inconsistent shave, my husband’s face doesn’t look as if he shaved at all. Not a close shave at all, visible stubble left behind.", "title": "Not worth the money", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "La calidad del producto fue malo la navaja había que usarla demasiado fuerte, lo termine devolviendo", "title": "No me gusto", "location_and_date": "Reviewed in the United States 🇺🇸 on June 23, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Disappointing, I knew this would not replace a razor, but it is not close.The precision is blade is weak.Overall very disappointing, not worth it.", "title": "Disappointing, I knew this would not replace a razor", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I haven't had an electric shaver since I was a young man. I am now 83. Niice clean shave, no burn, no iritation.I love everything about my new Braun.", "title": "Great close shave!!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My husband didn't really care for this razor because the hair falls out of it and onto his clothes.  He was using it this week and it just broke.  The head broke and will no longer shave him.  We just bought it for almost $130 on 12/28/2022.", "title": "Broke within 3 months.", "location_and_date": "Reviewed in the United States 🇺🇸 on April 6, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Gives a much better shave than my Phillip’s rotary. The instructions that come with the shaver are useless so you are on your own to figure it out  I have used it for three weeks and the battery is still full charge", "title": "Gives a good shave", "location_and_date": "Reviewed in the United States 🇺🇸 on July 25, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have used Braun shavers for more than 30 years and have always been very satisfied. When came time to update my older series 7 I saw this version on Amazon... Also a series 7 I figured that it would cut just as well... I ordered this one to spice things up as the head pivoted in every direction - I figured it would give a closer shave... WRONG... This is the worst shaver ever... If I shave every day, then maybe it would be OK, but if I skip a few days (say the weekend), shaving on the Monday morning is absolutely BRUTAL!!! It's like if the shaver was pulling every single hair out of my face instead of cutting them!!! I would return it in a nano second but I am out of the US now and can't send it back to Amazon... So, to me, this shaver is garbage... But to those who would say that I am a Braun basher, I have ordered a new shaver to replace this one, also a Braun, but the series 9... I most certainly hope that I will have more luck with that one... Anyway, this model was the BIGGEST letdown ever :(", "title": "Worst shaver ever!", "location_and_date": "Reviewed in the United States 🇺🇸 on September 13, 2021", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "First time i used it, I was pretty dissapointed but the second time I knew what I was doing and it was a breeze! No annoying cuts or feeling like you've just peeled your face. Highly recommend!", "title": "Throw that razor away!!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 25, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Unstable recharging base, no cover to protect shaving screens, and worst of all unusable user instructions. They are black and white illustrations, tightly packed so as to be indecipherable. Should I use a skin prep or shaving creme? Are there particular stokes to use? Helpful hints for a better shave? How to clean after a shave? They provide a brush, but I have no idea where the hair went. The head is clean. Why not provide a link to access a usable owner's manual! Shaves great, but should have sent it back.", "title": "Sad recharging base", "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I've had Braun shavers for 20+ years. When the previous one died (after about 8 years) I decided to \"upgrade\". This was a great choice as it functions much better than my previous Braun Series 5.", "title": "Great shaver.", "location_and_date": "Reviewed in the United States 🇺🇸 on February 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Not what I expected for a regularly priced razor at $150, I got it for $99 on Prime Day. So disappointed that it leaves whiskers behind. Very inconsistent shave, my husband’s face doesn’t look as if he shaved at all. Not a close shave at all, visible stubble left behind.", "title": "Not worth the money", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "La calidad del producto fue malo la navaja había que usarla demasiado fuerte, lo termine devolviendo", "title": "No me gusto", "location_and_date": "Reviewed in the United States 🇺🇸 on June 23, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Disappointing, I knew this would not replace a razor, but it is not close.The precision is blade is weak.Overall very disappointing, not worth it.", "title": "Disappointing, I knew this would not replace a razor", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I haven't had an electric shaver since I was a young man. I am now 83. Niice clean shave, no burn, no iritation.I love everything about my new Braun.", "title": "Great close shave!!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My husband didn't really care for this razor because the hair falls out of it and onto his clothes.  He was using it this week and it just broke.  The head broke and will no longer shave him.  We just bought it for almost $130 on 12/28/2022.", "title": "Broke within 3 months.", "location_and_date": "Reviewed in the United States 🇺🇸 on April 6, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Gives a much better shave than my Phillip’s rotary. The instructions that come with the shaver are useless so you are on your own to figure it out  I have used it for three weeks and the battery is still full charge", "title": "Gives a good shave", "location_and_date": "Reviewed in the United States 🇺🇸 on July 25, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have used Braun shavers for more than 30 years and have always been very satisfied. When came time to update my older series 7 I saw this version on Amazon... Also a series 7 I figured that it would cut just as well... I ordered this one to spice things up as the head pivoted in every direction - I figured it would give a closer shave... WRONG... This is the worst shaver ever... If I shave every day, then maybe it would be OK, but if I skip a few days (say the weekend), shaving on the Monday morning is absolutely BRUTAL!!! It's like if the shaver was pulling every single hair out of my face instead of cutting them!!! I would return it in a nano second but I am out of the US now and can't send it back to Amazon... So, to me, this shaver is garbage... But to those who would say that I am a Braun basher, I have ordered a new shaver to replace this one, also a Braun, but the series 9... I most certainly hope that I will have more luck with that one... Anyway, this model was the BIGGEST letdown ever :(", "title": "Worst shaver ever!", "location_and_date": "Reviewed in the United States 🇺🇸 on September 13, 2021", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "First time i used it, I was pretty dissapointed but the second time I knew what I was doing and it was a breeze! No annoying cuts or feeling like you've just peeled your face. Highly recommend!", "title": "Throw that razor away!!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 25, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Unstable recharging base, no cover to protect shaving screens, and worst of all unusable user instructions. They are black and white illustrations, tightly packed so as to be indecipherable. Should I use a skin prep or shaving creme? Are there particular stokes to use? Helpful hints for a better shave? How to clean after a shave? They provide a brush, but I have no idea where the hair went. The head is clean. Why not provide a link to access a usable owner's manual! Shaves great, but should have sent it back.", "title": "Sad recharging base", "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I've had Braun shavers for 20+ years. When the previous one died (after about 8 years) I decided to \"upgrade\". This was a great choice as it functions much better than my previous Braun Series 5.", "title": "Great shaver.", "location_and_date": "Reviewed in the United States 🇺🇸 on February 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Not what I expected for a regularly priced razor at $150, I got it for $99 on Prime Day. So disappointed that it leaves whiskers behind. Very inconsistent shave, my husband’s face doesn’t look as if he shaved at all. Not a close shave at all, visible stubble left behind.", "title": "Not worth the money", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "La calidad del producto fue malo la navaja había que usarla demasiado fuerte, lo termine devolviendo", "title": "No me gusto", "location_and_date": "Reviewed in the United States 🇺🇸 on June 23, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Disappointing, I knew this would not replace a razor, but it is not close.The precision is blade is weak.Overall very disappointing, not worth it.", "title": "Disappointing, I knew this would not replace a razor", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I haven't had an electric shaver since I was a young man. I am now 83. Niice clean shave, no burn, no iritation.I love everything about my new Braun.", "title": "Great close shave!!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My husband didn't really care for this razor because the hair falls out of it and onto his clothes.  He was using it this week and it just broke.  The head broke and will no longer shave him.  We just bought it for almost $130 on 12/28/2022.", "title": "Broke within 3 months.", "location_and_date": "Reviewed in the United States 🇺🇸 on April 6, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Gives a much better shave than my Phillip’s rotary. The instructions that come with the shaver are useless so you are on your own to figure it out  I have used it for three weeks and the battery is still full charge", "title": "Gives a good shave", "location_and_date": "Reviewed in the United States 🇺🇸 on July 25, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "I have used Braun shavers for more than 30 years and have always been very satisfied. When came time to update my older series 7 I saw this version on Amazon... Also a series 7 I figured that it would cut just as well... I ordered this one to spice things up as the head pivoted in every direction - I figured it would give a closer shave... WRONG... This is the worst shaver ever... If I shave every day, then maybe it would be OK, but if I skip a few days (say the weekend), shaving on the Monday morning is absolutely BRUTAL!!! It's like if the shaver was pulling every single hair out of my face instead of cutting them!!! I would return it in a nano second but I am out of the US now and can't send it back to Amazon... So, to me, this shaver is garbage... But to those who would say that I am a Braun basher, I have ordered a new shaver to replace this one, also a Braun, but the series 9... I most certainly hope that I will have more luck with that one... Anyway, this model was the BIGGEST letdown ever :(", "title": "Worst shaver ever!", "location_and_date": "Reviewed in the United States on September 13, 2021", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "First time i used it, I was pretty dissapointed but the second time I knew what I was doing and it was a breeze! No annoying cuts or feeling like you've just peeled your face. Highly recommend!", "title": "Throw that razor away!!", "location_and_date": "Reviewed in the United States on March 25, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Unstable recharging base, no cover to protect shaving screens, and worst of all unusable user instructions. They are black and white illustrations, tightly packed so as to be indecipherable. Should I use a skin prep or shaving creme? Are there particular stokes to use? Helpful hints for a better shave? How to clean after a shave? They provide a brush, but I have no idea where the hair went. The head is clean. Why not provide a link to access a usable owner's manual! Shaves great, but should have sent it back.", "title": "Sad recharging base", "location_and_date": "Reviewed in the United States on April 17, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I've had Braun shavers for 20+ years. When the previous one died (after about 8 years) I decided to \"upgrade\". This was a great choice as it functions much better than my previous Braun Series 5.", "title": "Great shaver.", "location_and_date": "Reviewed in the United States on February 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "Not what I expected for a regularly priced razor at $150, I got it for $99 on Prime Day. So disappointed that it leaves whiskers behind. Very inconsistent shave, my husband’s face doesn’t look as if he shaved at all. Not a close shave at all, visible stubble left behind.", "title": "Not worth the money", "location_and_date": "Reviewed in the United States on July 8, 2021", "verified": true, "rating": "3.0"},
{"asin": "B07Z8P11Y5", "text": "La calidad del producto fue malo la navaja había que usarla demasiado fuerte, lo termine devolviendo", "title": "No me gusto", "location_and_date": "Reviewed in the United States on June 23, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Disappointing, I knew this would not replace a razor, but it is not close.The precision is blade is weak.Overall very disappointing, not worth it.", "title": "Disappointing, I knew this would not replace a razor", "location_and_date": "Reviewed in the United States on December 3, 2022", "verified": true, "rating": "2.0"},
{"asin": "B07Z8P11Y5", "text": "I haven't had an electric shaver since I was a young man. I am now 83. Niice clean shave, no burn, no iritation.I love everything about my new Braun.", "title": "Great close shave!!", "location_and_date": "Reviewed in the United States on February 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07Z8P11Y5", "text": "My husband didn't really care for this razor because the hair falls out of it and onto his clothes.  He was using it this week and it just broke.  The head broke and will no longer shave him.  We just bought it for almost $130 on 12/28/2022.", "title": "Broke within 3 months.", "location_and_date": "Reviewed in the United States on April 6, 2023", "verified": true, "rating": "1.0"},
{"asin": "B07Z8P11Y5", "text": "Gives a much better shave than my Phillip’s rotary. The instructions that come with the shaver are useless so you are on your own to figure it out  I have used it for three weeks and the battery is still full charge", "title": "Gives a good shave", "location_and_date": "Reviewed in the United States on July 25, 2021", "verified": true, "rating": "5.0"}
]